Repository: antydemant/solax-cloud-api-notifier
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: uk

source: ❌ TELEGRAM_TOKEN is not set in the environment variables.
uk: ❌ TELEGRAM_TOKEN не знайдено в змінних середовища.

source: ❌ API returned an error:
uk: ❌ API повернуло помилку:

source: ❌ API error:
uk: ❌ Помилка API:

source: {hours} hours
uk: {hours} год

source: {minutes} minutes
uk: {minutes} хв

source: {seconds} seconds
uk: {seconds} сек

source: 0 seconds
uk: 0 сек

source: 🚨 Inverter has not updated data >5 minutes ({time})
uk: 🚨 Інвертор не оновлює дані >5 хв ({time})

source: ✅ Inverter is back online ({time})
uk: ✅ Інвертор знову онлайн ({time})

source: ⚠️ Power went out! ⏰ {time} SOC: {soc}% | Home: {acpower}W | Grid: {feedin}W
uk: ⚠️ Світло зникло! ⏰ {time} SOC: {soc}% | Будинок: {acpower}W | Мережа: {feedin}W

source: (out for {duration})
uk: (не було {duration})

source: ✅ Power is back! ⏰ {time}{duration} SOC: {soc}% | Home: {acpower}W | Grid: {feedin}W
uk: ✅ Світло з’явилось! ⏰ {time}{duration} SOC: {soc}% | Будинок: {acpower}W | Мережа: {feedin}W

source: 🚨 Inverter is unavailable (API not responding) ⏰ {time}
uk: 🚨 Інвертор недоступний (API не відповідає) ⏰ {time}

source: ▶️ Subscriber collector started...
uk: ▶️ Збирач підписок актиовано...

source: ✅ You are subscribed to power notifications ⚡️
uk: ✅ Ви підписані на сповіщення про світло ⚡️

source: ➕ New subscriber: {chat_id}
uk: ➕ Новий підписник: {chat_id}
